
```mermaid
flowchart TB

classDef default fill:#E7F6A4,stroke:#E7F6A4,stroke-width:2px,color:#435200;
classDef visited fill:#BACD66,stroke:#435200;

A(A)
B(B)
C/C2(C/C2)
C/C1 --> C/C2
D --> C/C2
C/C1(C/C1)
B --> C/C1
D(D)
tfmake/tests/terraform/basic/B(tfmake/tests/terraform/basic/B)
A --> tfmake/tests/terraform/basic/B
tfmake/tests/terraform/basic/A(tfmake/tests/terraform/basic/A)

A:::visited
tfmake/tests/terraform/basic/B:::visited
```

<details>
<summary>Module <strong>"A"</strong> Plan</summary>

```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/random...
- Installing hashicorp/random v3.4.3...
- Installed hashicorp/random v3.4.3 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
```

```

Error: Reference to undeclared local value

  on main.tf line 3, in resource "random_id" "id":
   3:     content = local.content

A local value with the name "content" has not been declared.
```

</details>
<details>
<summary>Module <strong>"tfmake/tests/terraform/basic/B"</strong> Plan</summary>

```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/random...
- Installing hashicorp/random v3.4.3...
- Installed hashicorp/random v3.4.3 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!
```

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # random_id.id will be created
  + resource "random_id" "id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "content" = "B"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + id = (known after apply)
```

</details>
